{
    "subject": "participant id",
    "session": "session number",
    "run": "current session's fMRI run number",
    "TrialNumber": "trial number within the current run, from 1 to 60",
    "image_path": "path to image file within data repository",
    "image_nr": "number attributed to the image within the current task dataset, from 1 to ~8634",
    "condition": {
      "seen": "the image has either been shown during the previous session (scan) or it is being repeated within the current session",
      "unseen": "the image has never at any time been shown to the participant"
    },
    "subcondition": {
      "unseen-between": "image has never been shown, WILL be shown a 2nd time during the NEXT session(fMRI scan), ~1 week later",
      "unseen-within": "image has never been shown, WILL be shown a 2nd time during the CURRENT fMRI session",
      "seen-between": "image was shown to the participant once before during the PREVIOUS session (~1 week ago)",
      "seen-within": "image was shown to the participant once before during the CURRENT session",
      "seen-within-between": "image was shown twice WITHIN the previous session (~1 week ago), is shown for the 3rd time during the current session",
      "seen-between-within": "image was first shown (once) during the previous session (~1 week ago), it was shown a second time during the current session, and is now shown for the third time",
    },
    "repetition": "the number of times an image has been shown (including current)",
    "onset": "time since scanner onset in seconds",
    "duration": "time during which the image is shown, in seconds",
    "response": "participant answer, derived by mapping the recorded key press with the trial's response mapping (flipped or not); 2 = seen, confident; 1 = seen, not confident; -1 = unseen, not confident; -2 unseen, condident",
    "error": "True = the participant's response (seen / unseen) does not correspond to the condition; False (no error) = the participant's response corresponds to the condition",

    "drift_correction_strategy": "Eye-tracking gaze is realigned based on the last period of central fixation. The drift correction strategy defines the period of fixation used to re-align a trial's gaze. Choices include previous_image, previous_isi, previous_image+isi, current_image and current_image+isi",
    "fix_gaze_count_ratio": "The ratio [0, 1] of gaze points captured during the fixation period (used to realign the trial's gaze; defined by the drift correction strategy). The ratio is calculated based on the fixation duration and the eyetrackin camera sampling rate. Low numbers may indicate eyetracking camera freezes.",
    "trial_gaze_count_ratio": "The ratio [0, 1] of gaze points captured during the trial's image presentation period. Low ratios indicate eyetracking camera freezes.",

    "fix_gaze_confidence_ratio_0.9": "The ratio [0, 1] of pupil points detected with a confidence > 90%  during the trial's fixation period (defined by the drift correction strategy). Low ratios indicate low quality data (e.g, due to drowsiness, excessive motion, poor camera focus, etc).",
    "fix_gaze_confidence_ratio_0.75": "The ratio [0, 1] of pupil points detected with a confidence > 75%  during the trial's fixation period.",
    "trial_gaze_confidence_ratio_0.9": "The ratio [0, 1] of pupil points detected with a confidence > 90%  during the trial's image presentation period. Low ratios indicate low quality data.",
    "trial_gaze_confidence_ratio_0.75": "The ratio [0, 1] of pupil points detected with a confidence > 75%  during the trial's image presentation period.",

    "median_dist_to_fixation_in_deg": "The distance, in degrees of visual angle, between the median gaze positions during the trial's image presentation and the fixation period (defined by drift correction strategy), respectively. High distances may indicate a shift in head position or poor fixation compliance.",
    "median_dist_to_previous_trial_in_deg": "The distance, in degrees of visual angle, between the median gaze position during the current and the previous trial's image presentation periods. High distances may indicate a shift in head position or poor fixation compliance.",

    "trial_fixation_compliance_ratio_0.5": "The ratio [0, 1] of gaze points within 0.5 degrees of visual angle from central fixation (estimated with the lastest fixation period's median gaze position) during the trial's image presentation. Low ratios indicate poor fixation and/or high head motion.",
    "trial_fixation_compliance_ratio_1.0": "The ratio [0, 1] of gaze points within 1.0 degrees of visual angle from central fixation during the trial's image presentation.",
    "trial_fixation_compliance_ratio_2.0": "The ratio [0, 1] of gaze points within 2.0 degrees of visual angle from central fixation during the trial's image presentation.",
    "trial_fixation_compliance_ratio_3.0": "The ratio [0, 1] of gaze points within 3.0 degrees of visual angle from central fixation during the trial's image presentation.",

    "trial_dist2med_ratio_0.5": "The ratio [0, 1] of gaze points within 0.5 degrees of visual angle from the median gaze position during the trial's image presentation. Low ratios indicate high variability in gaze position during image presentation (excessive motion / poor fixation).",
    "trial_dist2med_ratio_1.0": "The ratio [0, 1] of gaze points within 1.0 degrees of visual angle from the median gaze position during the trial's image presentation.",
    "trial_dist2med_ratio_2.0": "The ratio [0, 1] of gaze points within 2.0 degrees of visual angle from the median gaze position during the trial's image presentation.",
    "trial_dist2med_ratio_3.0": "The ratio [0, 1] of gaze points within 3.0 degrees of visual angle from the median gaze position during the trial's image presentation.",

    "fix_dist2med_ratio_0.5": "The ratio [0, 1] of gaze points within 0.5 degrees of visual angle from the median gaze position during the trial's fixation period. Low ratios indicate high variability in gaze position during fixation, which hinders the trial's drift correction (poor estimation of the point of central fixation.)",
    "fix_dist2med_ratio_1.0": "The ratio [0, 1] of gaze points within 1.0 degrees of visual angle from the median gaze position during the trial's fixation period.",
    "fix_dist2med_ratio_2.0": "The ratio [0, 1] of gaze points within 2.0 degrees of visual angle from the median gaze position during the trial's fixation period.",
    "fix_dist2med_ratio_3.0": "The ratio [0, 1] of gaze points within 3.0 degrees of visual angle from the median gaze position during the trial's fixation period."
}
